@Gerrit-K I tired same thing with  `azurerm `version 3.26. Please find the confirmation below.

Terraform plan:

```
+ resource "azurerm_eventhub_namespace" "example" {
      + auto_inflate_enabled                      = false
      + capacity                                  = 2
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "centralus"
      + maximum_throughput_units                  = (known after apply)
      + minimum_tls_version                       = (known after apply)
      + name                                      = "sree-example-namespace"
      + network_rulesets                          = [
          + {
              + default_action                 = "Allow"
              + ip_rule                        = []
              + public_network_access_enabled  = true
              + trusted_service_access_enabled = null
              + virtual_network_rule           = null
            },
        ]
      + public_network_access_enabled             = true
      + resource_group_name                       = "example-resources"
      + sku                                       = "Standard"
      + zone_redundant                            = false
    }
```
 
**Issues with Terraform Apply :**


```
│ Error: setting network ruleset properties for Namespace (Subscription: "xxxxxxxx"
│ Resource Group Name: "example-resources"
│ Namespace Name: "sree-example-namespace"): networkrulesets.NetworkRuleSetsClient#NamespacesCreateOrUpdateNetworkRuleSet: Failure responding to request: StatusCode=400 -- Original Error: autorest/azure: Service returned an error. Status=400 Code="BadRequest" Message="This update of networkRuleSets, sets zero IPRule and VirtualNetworkRules, and the DefaultAction is set to Deny. This would render the namespace resources inaccessible for data-plane requests. If the intention was to restrict data-plane requests to private links only, please set the PublicNetworkAccess property to Disabled. Else either set the DefaultAction property to Allow OR add some allowed IPRules or VirtualNetworkRules in the update request. CorrelationId: 7f8630e1-9692-7a5b-34b2-e64a1aa0258f"
│ 
│   with azurerm_eventhub_namespace.example,
│   on main.tf line 6, in resource "azurerm_eventhub_namespace" "example":
│    6: resource "azurerm_eventhub_namespace" "example" {
```

Working options :
- Option 1 : updating the `default_action = "Allow"` its works fine but this doesn’t help we need to make `Deny` all time.
- Option 2 : updating the `ip_rule = xx.xx.xx.xx/x` its works fine but we need to allow all IPS 

But we don’t to update  this fields not sure what changes in recent release version but if i use the  `azurerm `version 3.12.0 everything works fine? 